# ==========================================
# โจทย์ข้อที่ 2: คำนวณระดับเกรด (0 - 4)
# Input: คะแนนสอบ (จำนวนเต็ม 0 - 100)
# เงื่อนไข:
#   - คะแนน >= 80 ได้เกรด 4
#   - คะแนน >= 70 ได้เกรด 3
#   - คะแนน >= 60 ได้เกรด 2
#   - คะแนน >= 50 ได้เกรด 1
#   - คะแนนน้อยกว่า 50 ได้เกรด 0
# Output: ตัวเลขเกรด (0, 1, 2, 3 หรือ 4)
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
score = int(input())
ifscore >= 80
print("ได้เกรด4")
elsescores >= 70
print("ได้เกรด3")
elsescore >= 60
print("ได้เกรด2")
elsescore >= 50
print("ได้เกรด1")
