# ==========================================
# โจทย์ข้อที่ 5: จำแนกชนิดของสามเหลี่ยม
# Input: บรรทัดที่ 1 ความยาวด้าน A (จำนวนเต็มบวก)
#        บรรทัดที่ 2 ความยาวด้าน B (จำนวนเต็มบวก)
#        บรรทัดที่ 3 ความยาวด้าน C (จำนวนเต็มบวก)
# เงื่อนไข:
#   - เท่ากันทั้ง 3 ด้าน (A == B) and (B == C) -> พิมพ์ ("สามเหลี่ยมด้านเท่า")
#   - เท่ากัน 2 ด้าน (A == B) or (B == C) or (A == C) -> พิมพ์ ("สามเหลี่ยมหน้าจั่ว")
#   - ไม่มีด้านใดเท่ากันเลย -> พิมพ์ ("สามเหลี่ยมด้านไม่เท่า")
# Output: ประเภทสามเหลี่ยม ("สามเหลี่ยมด้านเท่า" ,"สามเหลี่ยมหน้าจั่ว" หรือ "สามเหลี่ยมด้านไม่เท่า" )
# ==========================================

# นักเรียนเขียนโค้ดต่อจากบรรทัดนี้
